Revit 2027 API
BuiltInFailures.OverlapFailures.DuplicatePoints Property
 There are identical points in the same place. Lines created from points may not work as expected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuplicatePoints { get; }
Public Shared ReadOnly Property DuplicatePoints As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuplicatePoints {
	FailureDefinitionId^ get ();
}
static member DuplicatePoints : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace